# IsViewValidForTemplateCreation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsViewValidForTemplateCreation Method
View Class See Also
---
Verifies that the view is valid for template creation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool IsViewValidForTemplateCreation()
```

Visual Basic
---
```text
Public Function IsViewValidForTemplateCreation As Boolean
```

Visual C++
---
```text
public:
bool IsViewValidForTemplateCreation()
```

# ### Return Value
True if the view can be used for view template creation, false otherwise.
# See Also
View Class
Autodesk.Revit.DB Namespace